about.html
<!doctype html>
<html lang="en-us" class=scroll-smooth data-default-appearance=light data-auto-appearance=true>
  <head>
    
    <!-- Clicky -->
    <!-- Clicky -->
    <meta charset="utf-8">
    <title>Luca's blog - Home</title>
    <meta name="description" content="">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="author" content="Luca Cambiaghi" />
    <meta name="description" content="Luca&#39;s blog" />
    <meta name="keywords" content="" />
    <link rel="stylesheet" href="https://lucacambiaghi.com/static/style.css" type="text/css" />
    <link rel="stylesheet" type="text/css" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css">
    
  </head>
  <body class="flex flex-col h-screen px-6 m-auto text-lg leading-7 bg-neutral text-neutral-900 sm:px-14 md:px-24 lg:px-32 dark:bg-neutral-800 dark:text-neutral max-w-7xl">
    

    
    <div id=the-top class="absolute flex self-center">
      <a class="px-3 py-1 text-sm -translate-y-8 rounded-b-lg bg-primary-200 dark:bg-neutral-600 focus:translate-y-0" href=#main-content>
        <span class="font-bold ltr:pr-2 rtl:pl-2 text-primary-600 dark:text-primary-400">&darr;
        </span>Skip to main content
      </a>
    </div>

    <header class="flex justify-between py-6 font-semibold sm:items-center sm:py-10 text-neutral-900 dark:text-neutral print:hidden">
      <div><a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href=/>Luca's blog </a></div>
<nav>
  <ul class="flex flex-col list-none sm:flex-row">
    <li class="mb-1 ltr:text-right rtl:text-left sm:mb-0 ltr:sm:mr-7 ltr:sm:last:mr-0 rtl:sm:ml-7 rtl:sm:last:ml-0">
      <a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href="https://lucacambiaghi.com/about.html">about</a>
    </li>
    <span class="px-2 text-primary-500">&#183;</span>
    <li class="mb-1 ltr:text-right rtl:text-left sm:mb-0 ltr:sm:mr-7 ltr:sm:last:mr-0 rtl:sm:ml-7 rtl:sm:last:ml-0">
      <a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href="https://lucacambiaghi.com/emacs.html">emacs</a>
    </li>
    <span class="px-2 text-primary-500">&#183;</span>
    <li class="mb-1 ltr:text-right rtl:text-left sm:mb-0 ltr:sm:mr-7 ltr:sm:last:mr-0 rtl:sm:ml-7 rtl:sm:last:ml-0">
      <a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href="http://lucacambiaghi.com/nixpkgs/readme.html">nix</a>
    </li>
    <span class="px-2 text-primary-500">&#183;</span>
    <li class="mb-1 ltr:text-right rtl:text-left sm:mb-0 ltr:sm:mr-7 ltr:sm:last:mr-0 rtl:sm:ml-7 rtl:sm:last:ml-0">
      <a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href="http://lucacambiaghi.com/nixpkgs/readme.html">
        <i class="fa fa-github" aria-hidden="true"></i>
        <span class="visually-hidden">github</span>
    </a></li>
  </ul>
</nav>
</header>


<main id="main" class="relative grow">
  
<article class="page">
  <h1 class="mt-0 text-4xl font-extrabold text-neutral-900 dark:text-neutral">
    About me
  </h1>
  <section class="prose dark:prose-invert">
    
<div id="outline-container-who-i-am" class="outline-2">
<h2 id="who-i-am">Who I am</h2>
<div class="outline-text-2">
<p>
My name is Luca, I am a Computer Scientist.
I grew up in northern Italy, orbiting around Milan.
In 2016 I moved to Copenhagen to achieve my MSc in Computer Science.
</p>

<p>
My favourite hobby is travelling.
After my graduation I spent 3 months backpacking across Chile, Bolivia, Peru and Colombia.
Another beautiful backpacking trip I have done was when visiting Nepal and India.
</p>

<p>
I also love reading and watching good movies and TV show.
The last book I read was 12 rules for life by Jordan Peterson.
The last TV show I (re)watched was Breaking Bad.
</p>

<p>
You can contact me by email at
</p>

<span style="cursor: pointer" onclick="this.textContent = ('luca.cambiaghi' + '@me' + String.fromCharCode(46) + 'com'); this.onclick = null; this.style.cursor='default'">(click.here.or.see.resume)</span>
</div>
</div>

<div id="outline-container-what-i-do" class="outline-2">
<h2 id="what-i-do">What I do</h2>
<div class="outline-text-2">
<p>
I am a Data Scientist, currently in between jobs.
My last employer was Maersk, a big Danish company which contributes to 30% of global trade with their container vessels.
I was working in the Demand Forecasting team, responsible for providing business users with hundreds of thousand of time series forecast every day.
</p>

<p>
We modelled customer demand from different angles, for example the number of empty containers imported and exported at each container pool.
Another example is how many containers would be ready to be loaded at each distinct terminal.
</p>

<p>
My next employer will be Boston Consulting Group.
In BCG Gamma, we solve the most challenging and impactful Data Science cases in a number of different industries.
</p>

<p>
I have experience in developing real world, scalable machine learning pipelines.
I am skilled in big data ingestion and cleaning, feature engineering, model development, deployment and monitoring.
</p>

<p>
Here you can see my full <a href="https://lucacambiaghi.com/static/resume.pdf">Resume</a> .
</p>
</div>
</div>

<div id="outline-container-how-i-do-it" class="outline-2">
<h2 id="how-i-do-it">How I do it</h2>
<div class="outline-text-2">
<p>
I am most productive with Python.
On a day to day basis I work with <code>numpy</code>, <code>pandas</code> and <code>scikit-learn</code>.
</p>

<p>
During my first year as a FTE I added <code>docker</code> and <code>kubernetes</code> to my toolbox.
</p>

<p>
I am fascinated by <code>clojure</code> and functional programming.
My free time projects are often an attempt to learn some part of the ecosystem.
I look forward to the day I will be doing my data science work in <code>clojure</code>.
</p>
</div>
</div>

  </section>
</article>

</main>



<footer class="py-10 print:hidden">
  <div class="flex justify-between">
    <div>
      <p class="text-sm text-neutral-500 dark:text-neutral-400">&copy;
        Luca Cambiaghi
      </p>
      <p class="text-xs text-neutral-500 dark:text-neutral-400">Theme inspired by
        <a class="hover:underline hover:decoration-primary-400 hover:text-primary-500" "href=https://git.io/hugo-congo" target=_blank rel="noopener noreferrer">Congo
        </a>
      </p>
    </div>
    <div class="text-sm cursor-pointer text-neutral-700 dark:text-neutral hover:text-primary-600 dark:hover:text-primary-400 ltr:mr-14 rtl:ml-14">
      <button id=appearance-switcher class="w-12 h-12" type=button title="Switch to dark appearance">
        <span class="inline dark:hidden"><span class="relative inline-block align-text-bottom icon"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path fill="currentcolor" d="M32 256C32 132.2 132.3 32 255.8 32c11.36.0 29.7 1.668 40.9 3.746 9.616 1.777 11.75 14.63 3.279 19.44C245 86.5 211.2 144.6 211.2 207.8c0 109.7 99.71 193 208.3 172.3 9.561-1.805 16.28 9.324 10.11 16.95C387.9 448.6 324.8 480 255.8 480 132.1 480 32 379.6 32 256z"/></svg></span></span><span class="hidden dark:inline"><span class="relative inline-block align-text-bottom icon"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path fill="currentcolor" d="M256 159.1c-53.02.0-95.1 42.98-95.1 95.1s41.2 96.9 95.1 96.9 95.1-42.98 95.1-95.1S309 159.1 256 159.1zM509.3 347l-63.2-91.9 63.15-91.01c6.332-9.125 1.104-21.74-9.826-23.72l-109-19.7-19.7-109c-1.975-10.93-14.59-16.16-23.72-9.824L256 65.89 164.1 2.736c-9.125-6.332-21.74-1.107-23.72 9.824L121.6 121.6 12.56 141.3C1.633 143.2-3.596 155.9 2.736 164.1L65.89 256 2.74 347.01c-6.332 9.125-1.105 21.74 9.824 23.72l109 19.7 19.7 109c1.975 10.93 14.59 16.16 23.72 9.824L256 446.1l91.01 63.15c9.127 6.334 21.75 1.107 23.72-9.822l19.7-109 109-19.7C510.4 368.8 515.6 356.1 509.3 347zM256 383.1c-70.69.0-127.1-57.31-127.1-127.1.0-70.69 57.31-127.1 127.1-127.1S383.1 186.2 383.1 256c0 70.7-56.4 127.1-127.1 127.1z"/></svg></span></span></button></div></div></footer>


</body>
</html>
